ryankurte/efm32-base/hardware/kit/common/bsp/thunderboard/hall_si7210.c
/***************************************************************************//**
 * @file
 * @brief Driver for the Silicon Labs Si72xx Hall Effect Sensor
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "hall_si7210.h"

#include <stddef.h>

#include "em_cmu.h"

#include "i2cspm.h"

#include "board.h"

#include "hall.h"
#include "hall_device.h"
#include "hall_config.h"

#include "hall_si7210_regs.h"

/**************************************************************************//**
* @addtogroup TBSense_BSP
* @{
******************************************************************************/

/**************************************************************************//**
* @addtogroup HALL
* @{
******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

static void usDelay(uint32_t delay);
static uint32_t SI7210_loadCoeffsFromOtp(uint8_t otpAddr);

/** @endcond */

/**************************************************************************//**
 * @brief
 *    Does device-specific initializaiton for the Si7210 chip.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t HALL_initDevice(void)
{
  uint32_t status;
  uint8_t  chipId;
  uint8_t  revId;

  /* Try to contact the sensor and check it's device ID */
  status = SI7210_wakeUp();
  if ( status != HALL_OK ) {
    return status;
  }

  status = SI7210_identify(&chipId, &revId);
  if ( status != HALL_OK ) {
    return status;
  }

  /* printf("HALL CHIPID: %d, REVID: %d\r\n", chipId, revId); */

  if ( (chipId != SI7210_CHIP_ID) || (revId < SI7210_REV_ID_MIN) || (revId > SI7210_REV_ID_MAX) ) {
    status = HALL_ERROR_DEVICE_ID_MISMATCH;
  }

  return status;
}

/**************************************************************************//**
 * @brief
 *    Does device-specific de-initializaiton for the Si7210 chip.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t HALL_deInitDevice(void)
{
  return 0;
}

/**************************************************************************//**
 * @brief
 *    Configures the Si7210 chip.
 *
 * @param[in] config
 *    The structure, which contains the configuration parameters.
 *    If all fields are set to zero, the chip will revert to use default values.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t HALL_configure(HALL_Config *config)
{
  uint32_t status;
  uint8_t value;
  uint8_t sw_op, sw_hyst;

  /* Wake up device and/or stop measurements */
  status = SI7210_wakeUp();
  if ( status != HALL_OK ) {
    return status;
  }

  /* Stop the measurement loop */
  status = SI7210_regSetBits(SI7210_REG_ADDR_POWER_CTRL,
                             SI7210_REG_POWER_CTRL_STOP_MASK);

  if ( status != HALL_OK ) {
    return status;
  }

  if ( (config->threshold == 0.0)
       && (config->hysteresis == 0.0)
       && (config->polarity == 0)
       && (config->outputInvert == 0) ) {
    /* Use default values in the device for all parameters */
    status = SI7210_regClearBits(SI7210_REG_ADDR_POWER_CTRL,
                                 SI7210_REG_POWER_CTRL_USESTORE_MASK);

    if ( status != HALL_OK ) {
      return status;
    }
  } else {
    /* Program sw_low4field and sw_op bit fields */
    sw_op = SI7210_calculateSWOP(config->threshold);

    value = 0;

    if ( config->outputInvert ) {
      value = (1 << SI7210_REG_CTRL1_SW_LOW4FIELD_SHIFT) & SI7210_REG_CTRL1_SW_LOW4FIELD_MASK;
    }

    value |= (sw_op << SI7210_REG_CTRL1_SW_OP_SHIFT) & SI7210_REG_CTRL1_SW_OP_MASK;

    status = SI7210_registerWrite(SI7210_REG_ADDR_CTRL1, value);
    if ( status != HALL_OK ) {
      return status;
    }

    /* Program sw_fieldpolsel and sw_hyst bit fields */
    sw_hyst = SI7210_calculateSWHYST(config->hysteresis, false);

    value = (config->polarity << SI7210_REG_CTRL2_SW_FIELDPOLSEL_SHIFT) & SI7210_REG_CTRL2_SW_FIELDPOLSEL_MASK;

    value |= (sw_hyst << SI7210_REG_CTRL2_SW_HYST_SHIFT) & SI7210_REG_CTRL2_SW_HYST_MASK;

    status = SI7210_registerWrite(SI7210_REG_ADDR_CTRL2, value);
    if ( status != HALL_OK ) {
      return status;
    }

    /* Enable storing of these parameters in sleep mode */
    status = SI7210_regSetBits(SI7210_REG_ADDR_POWER_CTRL,
                               SI7210_REG_POWER_CTRL_USESTORE_MASK);

    if ( status != HALL_OK ) {
      return status;
    }
  }

  /* Enable sleep timer and clear stop bit to start operation */
  status = SI7210_regSetBits(SI7210_REG_ADDR_CTRL3,
                             SI7210_REG_CTRL3_SLTIMEENA_MASK);

  if ( status != HALL_OK ) {
    return status;
  }

  /* Resume operation  */
  status = SI7210_regClearBits(SI7210_REG_ADDR_POWER_CTRL,
                               SI7210_REG_POWER_CTRL_STOP_MASK);

  return status;
}

/**************************************************************************//**
 * @brief
 *    Performs a measurement
 *
 * @param[in] scale
 *    Desired scale in uT
 *
 * @param[out] result
 *    The measured field strength value in mT
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t HALL_measure(uint32_t scale, float *result)
{
  int32_t mT;
  uint32_t status;
  bool range200mT;

  if ( scale > 20500 ) {
    range200mT = true;
  } else {
    range200mT = false;
  }

  status = SI7210_readmTDataSltimeena(range200mT, &mT);

  *result = ((float) mT) / 1000;

