ryankurte/efm32-base/hardware/kit/common/bsp/thunderboard/hall_si7210.c
  return status;
}

/**************************************************************************//**
 * @brief
 *    Returns the tamper level configured in the chip
 *
 * @return
 *    The tamper level in mT
 *****************************************************************************/
float HALL_getTamperLevel(void)
{
  return 19.87f;
}

/**************************************************************************//**
 * @defgroup Si7210 Si7210 - Hall Effect Sensor
 * @{
 * @brief Driver for the Silicon Labs Si7210 Hall effect sensor
 *****************************************************************************/

/**************************************************************************//**
 * @brief
 *    Read out Si7210 Conversion Data - 15bits
 *
 * @param[out] data
 *    The raw magnetic field conversion data (15 bits)
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_dataRead(int16_t *data)
{
  uint8_t read;
  uint8_t flag;
  uint32_t result;

  result = SI7210_registerRead(SI7210_REG_ADDR_DSPSIGM, &read);
  flag = read >> SI7210_REG_DSPSIGM_FRESH_SHIFT;
  *data = ((uint16_t)(read  & SI7210_REG_DSPSIGM_DSPSIGM_MASK)) << 8;
  result |= SI7210_registerRead(SI7210_REG_ADDR_DSPSIGL, &read);
  *data |= read;
  *data = *data - 16384;

  if ( flag == 0 ) {
    result = SI7210_ERROR_NODATA;
  }

  return result;
}

/**************************************************************************//**
 * @brief
 *    Puts Si7210 into Sleep (No-measurement) Mode
 *    Wake-up command needs to be issued to become responsive
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_sleep(void)
{
  uint32_t result;
  uint8_t read;

  result = SI7210_registerRead(SI7210_REG_ADDR_CTRL3, &read);
  // Clear the sleep timer enable bit
  read = (read & ~SI7210_REG_CTRL3_SLTIMEENA_MASK);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL3, read);
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  // Clear the oneburst and stop bits, set the sleep bit
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_STOP_MASK)) | SI7210_REG_POWER_CTRL_SLEEP_MASK);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  return result;
}
/**************************************************************************//**
 * @brief
 *    Puts Si7210 into Sleep w/ Measurement Mode: OUTPUT is updated 200msec
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_sleepSltimeena(void)
{
  uint8_t read;
  uint32_t result;

  result = SI7210_registerRead(SI7210_REG_ADDR_CTRL3, &read);
  // Set the sleep timer enable bit
  read = ((read & SI7210_REG_CTRL3_SW_TAMPER_MASK) | SI7210_REG_CTRL3_SLTIMEENA_MASK);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL3, read);
  result = SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  // Clear the oneburst, stop and sleep bits
  read = (read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK));
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  return result;
}

/**************************************************************************//**
 * @brief
 *    Read out Si7210 Revision and ID
 *
 * @param[out] id
 *    Si7210 part ID
 *
 * @param[out] rev
 *    Si7210 part Revision
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_identify(uint8_t *id, uint8_t *rev)
{
  uint8_t read;
  uint32_t result;

  result = SI7210_wakeUp();
  result |= SI7210_registerRead(SI7210_REG_ADDR_HREVID, &read);
  *rev = read & SI7210_REG_HREVID_REVID_MASK;
  *id = read >> SI7210_REG_HREVID_CHIPID_SHIFT;
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  // Clear the oneburst and sleep bits, set the stop bit
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | SI7210_REG_POWER_CTRL_STOP_MASK);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  return result;
}

/**************************************************************************//**
 * @brief
 *    Reads register from the OTP area of the Si7021 device
 *
 * @param[in] otpAddr
 *    The register address to read from in the sensor
 *
 * @param[out] otpData
 *    The data read from the device
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_regReadOTP(uint8_t otpAddr, uint8_t *otpData)
{
  uint32_t status;
  uint8_t reg;

  status = SI7210_registerRead(SI7210_REG_ADDR_OTP_CTRL, &reg);
  if ( status != HALL_OK ) {
    return status;
  }

  if ( reg & SI7210_REG_OTP_CTRL_BUSY_MASK ) {
    return SI7210_ERROR_OTP_BUSY;
  }

  status = SI7210_registerWrite(SI7210_REG_ADDR_OTP_ADDR, otpAddr);
  if ( status != HALL_OK ) {
    return status;
  }

  status = SI7210_registerWrite(SI7210_REG_ADDR_OTP_CTRL, SI7210_REG_OTP_CTRL_READ_EN_MASK);
  if ( status != HALL_OK ) {
    return status;
  }

  status = SI7210_registerRead(SI7210_REG_ADDR_OTP_DATA, otpData);

  return status;
}

/**************************************************************************//**
 * @brief
 *    Loads the coefficients A0..A6 from the OTP memory
 *
 * @param[in] otpAddr
 *    The register address to start reading from the OTP memory
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
static uint32_t SI7210_loadCoeffsFromOtp(uint8_t otpAddr)
{
  int i;
  uint32_t status;
  uint8_t value;

  const uint8_t writeAddr[] = {
    SI7210_REG_ADDR_A0,
    SI7210_REG_ADDR_A1,
    SI7210_REG_ADDR_A2,
    SI7210_REG_ADDR_A3,
    SI7210_REG_ADDR_A4,
    SI7210_REG_ADDR_A5
  };

  for ( i = 0; i < sizeof(writeAddr); i++ ) {
    status = SI7210_regReadOTP(otpAddr++, &value);

    if ( status != SI7210_OK ) {
      return status;
    }

    status = SI7210_registerWrite(writeAddr[i], value);

    if ( status != HALL_OK ) {
      return status;
    }
  }

