ryankurte/efm32-base/hardware/kit/common/bsp/thunderboard/hall_si7210.c
  return status;
}

/**************************************************************************//**
 * @brief
 *    Change Mag-Field scale to 200mT.
 *    If desired, must be performed after power-up or wake-up from sleep.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_set200mTRange(void)
{
  SI7210_loadCoeffsFromOtp(SI7210_OTP_ADDR_COEFFS_200MT);

  return SI7210_OK;
}

/**************************************************************************//**
 * @brief
 *   Perform burst-conversion(4samples), read mT-data, and then
 *   put part into sltimeena-sleep mode where OUT is updated every 200msec.
 *
 * @param[in] range200mT
 *   range200mT=false : full-scale equals 20mT
 *   range200mT=true  : full-scale equals 200mT
 *
 * @param[out] mTdata
 *   Mag-field conversion reading, signed 32-bit integer
 *   mTdata must be divided by 1000 to get decimal value in mT units
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_readmTDataSltimeena(bool range200mT, int32_t *mTdata)
{
  uint8_t read;
  int16_t data;
  uint32_t result;

  result = SI7210_wakeUp();
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  // Clear oneburst and sleep bits, set Usestore and stop to stop measurements
  //read = ( ( read & 0xF0 ) | 0x0A );
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_STOP_MASK));
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);
  // Burst sample size = 4 (2^2), number of samples to average = 4 (2^2)
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL4, ((2 << SI7210_REG_CTRL4_DF_BURSTSIZE_SHIFT) | (2 << SI7210_REG_CTRL4_DF_BW_SHIFT)));
  if ( range200mT ) {
    result |= SI7210_set200mTRange();
  }
  // Clear stop and sleep bits, set Usestore and oneburst to start a burst of measurements
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  read = ((read & ~(SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_ONEBURST_MASK));
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  // Wait until the measurement is done
  do {
    result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  } while ( (read >> SI7210_REG_POWER_CTRL_MEAS_SHIFT) && (result == 0) );

  result |= SI7210_dataRead(&data);

  // To convert mTdata to decimal value, divide by 1000
  if ( range200mT ) {
    *mTdata = (data * 125 / 10);
  } else {
    *mTdata = (data * 125 / 100);
  }

  // Go to sleep with sleep timer enabled
  result |= SI7210_sleepSltimeena();

  return result;
}

/**************************************************************************//**
 * @brief
 *   Wake-up from Sleep, perform burst-conversion(4samples), read mT-data,
 *   and then put part into sleep mode (no-measurement). Requires Wake-Up.
 *
 * @param[in] range200mT
 *   range200mT=false : full-scale equals 20mT
 *   range200mT=true  : full-scale equals 200mT
 *
 * @param[out] mTdata
 *   Mag-field conversion reading, signed 32-bit integer
 *   mTdata must be divided by 1000 to get decimal value in mT units
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_readmTDataSleep(bool range200mT, int32_t *mTdata)
{
  uint8_t read;
  int16_t data;
  uint32_t result;

  result = SI7210_wakeUp();
  result = SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  // Clear oneburst and sleep bits, set Usestore and stop to stop measurements
  //read = ( ( read & 0xF0 ) | 0x0A );
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_STOP_MASK));
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);
  // Burst sample size = 4 (2^2), number of samples to average = 4 (2^2)
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL4, ((2 << SI7210_REG_CTRL4_DF_BURSTSIZE_SHIFT) | (2 << SI7210_REG_CTRL4_DF_BW_SHIFT)));
  if ( range200mT ) {
    result |= SI7210_set200mTRange();
  }
  // Clear stop and sleep bits, set Usestore and oneburst to start a burst of measurements
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  read = ((read & ~(SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_ONEBURST_MASK));
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  // Wait until the measurement is done
  do {
    result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  } while ( (read >> SI7210_REG_POWER_CTRL_MEAS_SHIFT) && (result == 0) );

  result |= SI7210_dataRead(&data);

  // To convert mTdata to decimal value, divide by 1000
  if ( range200mT ) {
    *mTdata = (data * 125 / 10);
  } else {
    *mTdata = (data * 125 / 100);
  }

  // Go to sleep
  result |= SI7210_sleep();

  return result;
}

/**************************************************************************//**
 * @brief
 *   Puts sensor into continuous mode, conversions performed every 7usec
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_enterContMode(void)
{
  uint8_t read;
  uint32_t result;

  result = SI7210_wakeUp();
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  read = ((read & 0xF0) | 0x0A);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_DSPSIGSEL, 4);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL1, 0x7F);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL2, 0x92);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_SLTIME, 0x00);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_CTRL3, 0xFE);
  result |= SI7210_registerRead(SI7210_REG_ADDR_POWER_CTRL, &read);
  read = (read & 0xF8);
  result |= SI7210_registerWrite(SI7210_REG_ADDR_POWER_CTRL, read);

  return result;
}

/**************************************************************************//**
 * @brief
 *    Calculates the sw_op value from the threshold by finding the inverse of
 *    the formula:
 *    threshold = (16 + sw_op[3:0]) * 2^sw_op[6:4]
 *
 * @param[in] threshold
 *    Threshold value
 *
 * @return
 *    The value of the sw_op bitfield
 *****************************************************************************/
uint8_t SI7210_calculateSWOP(float threshold)
{
  int th;
  uint8_t a;
  uint8_t swop;

  th = (int) (threshold / 0.005);

  if ( th == 0 ) {
    /* threshold = 0, when swop = 127 */
    return 127;
  } else if ( th < 16 ) {
    threshold = 16;
  } else if ( threshold > 3840 ) {
    threshold = 3840;
  }

  a = th / 16;
  swop = 0;
  while ( a != 0x01 ) {
    a = a >> 1;   /* Find the most significant 1 of th */
    swop += 0x10;   /* increment sw_op[6:4] */
  }

  /* Add remainder as sw_op[3:0] */
  swop |= th / (1 << (swop >> 4)) - 16;

