ryankurte/efm32-base/hardware/kit/common/bsp/thunderboard/hall_si7210.c
  value |= mask;

  status = SI7210_registerWrite(addr, value);

  return status;
}

/**************************************************************************//**
 * @brief
 *    Clears the given bit(s) in a register in the Hall sensor device
 *
 * @param[in] addr
 *    The address of the register
 *
 * @param[in] mask
 *    The mask specifies which bits should be clear. If a given bit of the mask
 *    is 1 that register bit will be cleared to 0. All the other register bits
 *    will be untouched.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 *****************************************************************************/
uint32_t SI7210_regClearBits(uint8_t addr, uint8_t mask)
{
  uint8_t value;
  uint32_t status;

  status = SI7210_registerRead(addr, &value);
  if ( status != HALL_OK ) {
    return status;
  }

  value &= ~mask;

  status = SI7210_registerWrite(addr, value);

  return status;
}

/**************************************************************************//**
 * @brief
 *    Wakes up the Hall sensor chip
 *
 * @return
 *    None
 *****************************************************************************/
uint32_t SI7210_wakeUp(void)
{
  I2C_TransferSeq_TypeDef seq;
  I2C_TransferReturn_TypeDef ret;

  seq.addr = SI7210_I2C_BUS_ADDRESS << 1;
  seq.flags = I2C_FLAG_WRITE;

  seq.buf[0].len = 0;
  seq.buf[0].data = NULL;

  BOARD_i2cBusSelect(BOARD_I2C_BUS_SELECT_HALL);

  ret = I2CSPM_Transfer(SI7210_I2C_DEVICE, &seq);
  if ( ret != i2cTransferDone ) {
    return HALL_ERROR_I2C_TRANSACTION_FAILED;
  }

  usDelay(10);

  return HALL_OK;
}
/** @} {end defgroup Si7210} */

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/**************************************************************************//**
 * @brief
 *    Microseconds delay routine
 *
 * @param[in] delay
 *    The desired delay time in microseconds
 *
 * @return
 *    None
 *****************************************************************************/
static void usDelay(uint32_t delay)
{
  volatile uint32_t cnt;

  cnt = CMU_ClockFreqGet(cmuClock_HF) * delay / (uint32_t) 1e6;
  cnt /= 7;  /* 7 cycles per loop count */

  while ( cnt-- )
    ;

  return;
}
/** @endcond */

/** @} {end addtogroup HALL} */
/** @} {end addtogroup TBSense_BSP} */
